#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 306d6c6d2fa8353b519426e4d807614b.pdb
; shader hash: 306d6c6d2fa8353b519426e4d807614b
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       uint2 TextureSize;                            ; Offset:    0
;       uint ShadingRateTileSize;                     ; Offset:    8
;       float SensitivityThreshold;                   ; Offset:   12
;       float EnvLuma;                                ; Offset:   16
;       float K;                                      ; Offset:   20
;       float WeberFechnerConstant;                   ; Offset:   24
;       bool UseWeberFechner;                         ; Offset:   28
;       bool UseMotionVectors;                        ; Offset:   32
;       bool AllowQuarterRate;                        ; Offset:   36
;       uint2 UpscaledSize;                           ; Offset:   40
;       bool UseUpscaledMotionVectors;                ; Offset:   48
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !37, globals: !84)
!1 = !DIFile(filename: "src\5CValar8x8CS.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ShadingRateAxis", file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "src/VRSCommon.hlsli", directory: "")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_1X", value: 0)
!7 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_2X", value: 1)
!8 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_4X", value: 2)
!9 = !{!10, !20, !24, !28, !19, !29}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 30, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 30, size: 64, align: 32, elements: !12, templateParams: !16)
!12 = !{!13, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 30, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 30, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !{!17, !18}
!17 = !DITemplateTypeParameter(name: "element", type: !14)
!18 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 2)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 192, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 192, size: 64, align: 32, elements: !22, templateParams: !26)
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, line: 192, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, line: 192, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !{!27, !18}
!27 = !DITemplateTypeParameter(name: "element", type: !24)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 31, baseType: !14)
!29 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 204, baseType: !30)
!30 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 204, size: 96, align: 32, elements: !31, templateParams: !35)
!31 = !{!32, !33, !34}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !30, file: !1, line: 204, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !30, file: !1, line: 204, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !30, file: !1, line: 204, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!35 = !{!27, !36}
!36 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 3)
!37 = !{!38, !49, !68, !71, !74, !77, !80, !81}
!38 = !DISubprogram(name: "main", scope: !39, file: !39, line: 130, type: !40, isLocal: false, isDefinition: true, scopeLine: 131, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!39 = !DIFile(filename: "src/ValarCS.hlsli", directory: "")
!40 = !DISubroutineType(types: !41)
!41 = !{null, !42, !28, !42, !42}
!42 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 84, baseType: !43)
!43 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 84, size: 96, align: 32, elements: !44, templateParams: !48)
!44 = !{!45, !46, !47}
!45 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !43, file: !1, line: 84, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !43, file: !1, line: 84, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!47 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !43, file: !1, line: 84, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!48 = !{!17, !36}
!49 = !DISubprogram(name: "FetchColor", linkageName: "\01?FetchColor@@YA?AV?$vector@M$03@@V?$vector@H$01@@@Z", scope: !39, file: !39, line: 55, type: !50, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!50 = !DISubroutineType(types: !51)
!51 = !{!52, !61}
!52 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 136, baseType: !53)
!53 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 136, size: 128, align: 32, elements: !54, templateParams: !59)
!54 = !{!55, !56, !57, !58}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !53, file: !1, line: 136, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !53, file: !1, line: 136, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !53, file: !1, line: 136, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !53, file: !1, line: 136, baseType: !24, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!59 = !{!27, !60}
!60 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 4)
!61 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 59, baseType: !62)
!62 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 59, size: 64, align: 32, elements: !63, templateParams: !66)
!63 = !{!64, !65}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !62, file: !1, line: 59, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !62, file: !1, line: 59, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!66 = !{!67, !18}
!67 = !DITemplateTypeParameter(name: "element", type: !19)
!68 = !DISubprogram(name: "RGBToLuminance", linkageName: "\01?RGBToLuminance@@YAMV?$vector@M$03@@@Z", scope: !4, file: !4, line: 72, type: !69, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false)
!69 = !DISubroutineType(types: !70)
!70 = !{!24, !52}
!71 = !DISubprogram(name: "ComputeMinNeighborLuminance", linkageName: "\01?ComputeMinNeighborLuminance@@YAMV?$vector@I$01@@@Z", scope: !39, file: !39, line: 86, type: !72, isLocal: false, isDefinition: true, scopeLine: 87, flags: DIFlagPrototyped, isOptimized: false)
!72 = !DISubroutineType(types: !73)
!73 = !{!24, !10}
!74 = !DISubprogram(name: "UnpackVelocity", linkageName: "\01?UnpackVelocity@@YA?AV?$vector@M$02@@I@Z", scope: !39, file: !39, line: 73, type: !75, isLocal: false, isDefinition: true, scopeLine: 74, flags: DIFlagPrototyped, isOptimized: false)
!75 = !DISubroutineType(types: !76)
!76 = !{!29, !28}
!77 = !DISubprogram(name: "UnpackXY", linkageName: "\01?UnpackXY@@YAMI@Z", scope: !39, file: !39, line: 63, type: !78, isLocal: false, isDefinition: true, scopeLine: 64, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{!24, !28}
!80 = !DISubprogram(name: "UnpackZ", linkageName: "\01?UnpackZ@@YAMI@Z", scope: !39, file: !39, line: 68, type: !78, isLocal: false, isDefinition: true, scopeLine: 69, flags: DIFlagPrototyped, isOptimized: false)
!81 = !DISubprogram(name: "SetShadingRate", linkageName: "\01?SetShadingRate@@YAXV?$vector@H$01@@I@Z", scope: !4, file: !4, line: 54, type: !82, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!82 = !DISubroutineType(types: !83)
!83 = !{null, !61, !28}
!84 = !{!85, !87, !89, !91, !92, !93, !94, !97, !98, !99, !100, !101, !105, !106, !107, !108, !109, !113, !117, !118, !122}
!85 = !DIGlobalVariable(name: "TextureSize", linkageName: "\01?TextureSize@CB0@@3V?$vector@I$01@@B", scope: !0, file: !39, line: 30, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!87 = !DIGlobalVariable(name: "ShadingRateTileSize", linkageName: "\01?ShadingRateTileSize@CB0@@3IB", scope: !0, file: !39, line: 31, type: !88, isLocal: false, isDefinition: true)
!88 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !28)
!89 = !DIGlobalVariable(name: "SensitivityThreshold", linkageName: "\01?SensitivityThreshold@CB0@@3MB", scope: !0, file: !39, line: 32, type: !90, isLocal: false, isDefinition: true)
!90 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!91 = !DIGlobalVariable(name: "EnvLuma", linkageName: "\01?EnvLuma@CB0@@3MB", scope: !0, file: !39, line: 33, type: !90, isLocal: false, isDefinition: true)
!92 = !DIGlobalVariable(name: "K", linkageName: "\01?K@CB0@@3MB", scope: !0, file: !39, line: 34, type: !90, isLocal: false, isDefinition: true)
!93 = !DIGlobalVariable(name: "WeberFechnerConstant", linkageName: "\01?WeberFechnerConstant@CB0@@3MB", scope: !0, file: !39, line: 35, type: !90, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "UseWeberFechner", linkageName: "\01?UseWeberFechner@CB0@@3_NB", scope: !0, file: !39, line: 36, type: !95, isLocal: false, isDefinition: true)
!95 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !96)
!96 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!97 = !DIGlobalVariable(name: "UseMotionVectors", linkageName: "\01?UseMotionVectors@CB0@@3_NB", scope: !0, file: !39, line: 37, type: !95, isLocal: false, isDefinition: true)
!98 = !DIGlobalVariable(name: "AllowQuarterRate", linkageName: "\01?AllowQuarterRate@CB0@@3_NB", scope: !0, file: !39, line: 38, type: !95, isLocal: false, isDefinition: true)
