#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 283772690fc12fef90cabdbfa9befb52.pdb
; shader hash: 283772690fc12fef90cabdbfa9befb52
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       uint2 TextureSize;                            ; Offset:    0
;       uint ShadingRateTileSize;                     ; Offset:    8
;       float SensitivityThreshold;                   ; Offset:   12
;       float EnvLuma;                                ; Offset:   16
;       float K;                                      ; Offset:   20
;       float WeberFechnerConstant;                   ; Offset:   24
;       bool UseWeberFechner;                         ; Offset:   28
;       bool UseMotionVectors;                        ; Offset:   32
;       bool AllowQuarterRate;                        ; Offset:   36
;       uint2 UpscaledSize;                           ; Offset:   40
;       bool UseUpscaledMotionVectors;                ; Offset:   48
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !36, globals: !80)
!1 = !DIFile(filename: "src\5CValarLPCS.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ShadingRateAxis", file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "src/VRSCommon.hlsli", directory: "")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_1X", value: 0)
!7 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_2X", value: 1)
!8 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_4X", value: 2)
!9 = !{!10, !20, !24, !28}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !12, templateParams: !16)
!12 = !{!13, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 29, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 29, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !{!17, !18}
!17 = !DITemplateTypeParameter(name: "element", type: !14)
!18 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 2)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 112, baseType: !21)
!21 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 112, size: 64, align: 32, elements: !22, templateParams: !26)
!22 = !{!23, !25}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !21, file: !1, line: 112, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!24 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !21, file: !1, line: 112, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!26 = !{!27, !18}
!27 = !DITemplateTypeParameter(name: "element", type: !24)
!28 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 74, baseType: !29)
!29 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 74, size: 96, align: 32, elements: !30, templateParams: !34)
!30 = !{!31, !32, !33}
!31 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !29, file: !1, line: 74, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !29, file: !1, line: 74, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!33 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !29, file: !1, line: 74, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!34 = !{!27, !35}
!35 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 3)
!36 = !{!37, !48, !67, !70, !73, !76, !77}
!37 = !DISubprogram(name: "main", scope: !1, file: !1, line: 78, type: !38, isLocal: false, isDefinition: true, scopeLine: 79, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!38 = !DISubroutineType(types: !39)
!39 = !{null, !40, !47, !40, !40}
!40 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 41, baseType: !41)
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 41, size: 96, align: 32, elements: !42, templateParams: !46)
!42 = !{!43, !44, !45}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !41, file: !1, line: 41, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !41, file: !1, line: 41, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!45 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !41, file: !1, line: 41, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!46 = !{!17, !35}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 30, baseType: !14)
!48 = !DISubprogram(name: "FetchColor", linkageName: "\01?FetchColor@@YA?AV?$vector@M$03@@V?$vector@H$01@@@Z", scope: !1, file: !1, line: 53, type: !49, isLocal: false, isDefinition: true, scopeLine: 53, flags: DIFlagPrototyped, isOptimized: false)
!49 = !DISubroutineType(types: !50)
!50 = !{!51, !60}
!51 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 83, baseType: !52)
!52 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 83, size: 128, align: 32, elements: !53, templateParams: !58)
!53 = !{!54, !55, !56, !57}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !52, file: !1, line: 83, baseType: !24, size: 32, align: 32, flags: DIFlagPublic)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !52, file: !1, line: 83, baseType: !24, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !52, file: !1, line: 83, baseType: !24, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !52, file: !1, line: 83, baseType: !24, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!58 = !{!27, !59}
!59 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 4)
!60 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 57, baseType: !61)
!61 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 57, size: 64, align: 32, elements: !62, templateParams: !65)
!62 = !{!63, !64}
!63 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !61, file: !1, line: 57, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !61, file: !1, line: 57, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!65 = !{!66, !18}
!66 = !DITemplateTypeParameter(name: "element", type: !19)
!67 = !DISubprogram(name: "RGBToLuminance", linkageName: "\01?RGBToLuminance@@YAMV?$vector@M$03@@@Z", scope: !4, file: !4, line: 72, type: !68, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{!24, !51}
!70 = !DISubprogram(name: "UnpackVelocity", linkageName: "\01?UnpackVelocity@@YA?AV?$vector@M$02@@I@Z", scope: !1, file: !1, line: 69, type: !71, isLocal: false, isDefinition: true, scopeLine: 70, flags: DIFlagPrototyped, isOptimized: false)
!71 = !DISubroutineType(types: !72)
!72 = !{!28, !47}
!73 = !DISubprogram(name: "UnpackXY", linkageName: "\01?UnpackXY@@YAMI@Z", scope: !1, file: !1, line: 59, type: !74, isLocal: false, isDefinition: true, scopeLine: 60, flags: DIFlagPrototyped, isOptimized: false)
!74 = !DISubroutineType(types: !75)
!75 = !{!24, !47}
!76 = !DISubprogram(name: "UnpackZ", linkageName: "\01?UnpackZ@@YAMI@Z", scope: !1, file: !1, line: 64, type: !74, isLocal: false, isDefinition: true, scopeLine: 65, flags: DIFlagPrototyped, isOptimized: false)
!77 = !DISubprogram(name: "SetShadingRate", linkageName: "\01?SetShadingRate@@YAXV?$vector@H$01@@I@Z", scope: !4, file: !4, line: 54, type: !78, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!78 = !DISubroutineType(types: !79)
!79 = !{null, !60, !47}
!80 = !{!81, !83, !85, !87, !88, !89, !90, !93, !94, !95, !96, !97, !101, !105, !106}
!81 = !DIGlobalVariable(name: "TextureSize", linkageName: "\01?TextureSize@CB0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 29, type: !82, isLocal: false, isDefinition: true)
!82 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!83 = !DIGlobalVariable(name: "ShadingRateTileSize", linkageName: "\01?ShadingRateTileSize@CB0@@3IB", scope: !0, file: !1, line: 30, type: !84, isLocal: false, isDefinition: true)
!84 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !47)
!85 = !DIGlobalVariable(name: "SensitivityThreshold", linkageName: "\01?SensitivityThreshold@CB0@@3MB", scope: !0, file: !1, line: 31, type: !86, isLocal: false, isDefinition: true)
!86 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !24)
!87 = !DIGlobalVariable(name: "EnvLuma", linkageName: "\01?EnvLuma@CB0@@3MB", scope: !0, file: !1, line: 32, type: !86, isLocal: false, isDefinition: true)
!88 = !DIGlobalVariable(name: "K", linkageName: "\01?K@CB0@@3MB", scope: !0, file: !1, line: 33, type: !86, isLocal: false, isDefinition: true)
!89 = !DIGlobalVariable(name: "WeberFechnerConstant", linkageName: "\01?WeberFechnerConstant@CB0@@3MB", scope: !0, file: !1, line: 34, type: !86, isLocal: false, isDefinition: true)
!90 = !DIGlobalVariable(name: "UseWeberFechner", linkageName: "\01?UseWeberFechner@CB0@@3_NB", scope: !0, file: !1, line: 35, type: !91, isLocal: false, isDefinition: true)
!91 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !92)
!92 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!93 = !DIGlobalVariable(name: "UseMotionVectors", linkageName: "\01?UseMotionVectors@CB0@@3_NB", scope: !0, file: !1, line: 36, type: !91, isLocal: false, isDefinition: true)
!94 = !DIGlobalVariable(name: "AllowQuarterRate", linkageName: "\01?AllowQuarterRate@CB0@@3_NB", scope: !0, file: !1, line: 37, type: !91, isLocal: false, isDefinition: true)
!95 = !DIGlobalVariable(name: "UpscaledSize", linkageName: "\01?UpscaledSize@CB0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 40, type: !82, isLocal: false, isDefinition: true)
!96 = !DIGlobalVariable(name: "UseUpscaledMotionVectors", linkageName: "\01?UseUpscaledMotionVectors@CB0@@3_NB", scope: !0, file: !1, line: 41, type: !91, isLocal: false, isDefinition: true)
