#if 0
;
; Note: shader requires additional functionality:
;       Typed UAV Load Additional Formats
;       Wave level operations
;
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: 1eea70d43697ffc307b7b2a5dd5adeb3.pdb
; shader hash: 1eea70d43697ffc307b7b2a5dd5adeb3
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       uint2 NativeSize;                             ; Offset:    0
;       uint ShadingRateTileSize;                     ; Offset:    8
;       float SensitivityThreshold;                   ; Offset:   12
;       float EnvLuma;                                ; Offset:   16
;       float K;                                      ; Offset:   20
;       float WeberFechnerConstant;                   ; Offset:   24
;       bool UseWeberFechner;                         ; Offset:   28
;       bool UseMotionVectors;                        ; Offset:   32
;       bool AllowQuarterRate;                        ; Offset:   36
;       uint2 UpscaledSize;                           ; Offset:   40
;       bool UseUpscaledMotionVectors;                ; Offset:   48
;   

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !9, subprograms: !31, globals: !70)
!1 = !DIFile(filename: "src\5CValar16x16CS.hlsl", directory: "")
!2 = !{!3}
!3 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ShadingRateAxis", file: !4, line: 42, size: 32, align: 32, elements: !5)
!4 = !DIFile(filename: "src/VRSCommon.hlsli", directory: "")
!5 = !{!6, !7, !8}
!6 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_1X", value: 0)
!7 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_2X", value: 1)
!8 = !DIEnumerator(name: "D3D12_AXIS_SHADING_RATE_4X", value: 2)
!9 = !{!10, !20, !21, !22}
!10 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 29, baseType: !11)
!11 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 29, size: 64, align: 32, elements: !12, templateParams: !16)
!12 = !{!13, !15}
!13 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !11, file: !1, line: 29, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!14 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !11, file: !1, line: 29, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!16 = !{!17, !18}
!17 = !DITemplateTypeParameter(name: "element", type: !14)
!18 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 2)
!19 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!20 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!21 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 30, baseType: !14)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, line: 189, baseType: !23)
!23 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, line: 189, size: 96, align: 32, elements: !24, templateParams: !28)
!24 = !{!25, !26, !27}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !23, file: !1, line: 189, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !23, file: !1, line: 189, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !23, file: !1, line: 189, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!28 = !{!29, !30}
!29 = !DITemplateTypeParameter(name: "element", type: !20)
!30 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 3)
!31 = !{!32, !42, !61, !64, !67}
!32 = !DISubprogram(name: "main", scope: !1, file: !1, line: 115, type: !33, isLocal: false, isDefinition: true, scopeLine: 116, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!33 = !DISubroutineType(types: !34)
!34 = !{null, !35, !21, !35, !35}
!35 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 69, baseType: !36)
!36 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 69, size: 96, align: 32, elements: !37, templateParams: !41)
!37 = !{!38, !39, !40}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !36, file: !1, line: 69, baseType: !14, size: 32, align: 32, flags: DIFlagPublic)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !36, file: !1, line: 69, baseType: !14, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !36, file: !1, line: 69, baseType: !14, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!41 = !{!17, !30}
!42 = !DISubprogram(name: "FetchColor", linkageName: "\01?FetchColor@@YA?AV?$vector@M$03@@V?$vector@H$01@@@Z", scope: !1, file: !1, line: 55, type: !43, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!43 = !DISubroutineType(types: !44)
!44 = !{!45, !54}
!45 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 121, baseType: !46)
!46 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 121, size: 128, align: 32, elements: !47, templateParams: !52)
!47 = !{!48, !49, !50, !51}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !46, file: !1, line: 121, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !46, file: !1, line: 121, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !46, file: !1, line: 121, baseType: !20, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !46, file: !1, line: 121, baseType: !20, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!52 = !{!29, !53}
!53 = !DITemplateValueParameter(name: "element_count", type: !19, value: i32 4)
!54 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 59, baseType: !55)
!55 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 59, size: 64, align: 32, elements: !56, templateParams: !59)
!56 = !{!57, !58}
!57 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !55, file: !1, line: 59, baseType: !19, size: 32, align: 32, flags: DIFlagPublic)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !55, file: !1, line: 59, baseType: !19, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!59 = !{!60, !18}
!60 = !DITemplateTypeParameter(name: "element", type: !19)
!61 = !DISubprogram(name: "RGBToLuminance", linkageName: "\01?RGBToLuminance@@YAMV?$vector@M$03@@@Z", scope: !4, file: !4, line: 72, type: !62, isLocal: false, isDefinition: true, scopeLine: 73, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!20, !45}
!64 = !DISubprogram(name: "ComputeMinNeighborLuminance", linkageName: "\01?ComputeMinNeighborLuminance@@YAMV?$vector@I$01@@@Z", scope: !1, file: !1, line: 71, type: !65, isLocal: false, isDefinition: true, scopeLine: 72, flags: DIFlagPrototyped, isOptimized: false)
!65 = !DISubroutineType(types: !66)
!66 = !{!20, !10}
!67 = !DISubprogram(name: "SetShadingRate", linkageName: "\01?SetShadingRate@@YAXV?$vector@H$01@@I@Z", scope: !4, file: !4, line: 54, type: !68, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!68 = !DISubroutineType(types: !69)
!69 = !{null, !54, !21}
!70 = !{!71, !73, !75, !77, !78, !79, !80, !83, !84, !85, !86, !87, !91, !92, !93, !94, !95, !99, !103, !104, !113}
!71 = !DIGlobalVariable(name: "NativeSize", linkageName: "\01?NativeSize@CB0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 29, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !10)
!73 = !DIGlobalVariable(name: "ShadingRateTileSize", linkageName: "\01?ShadingRateTileSize@CB0@@3IB", scope: !0, file: !1, line: 30, type: !74, isLocal: false, isDefinition: true)
!74 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !21)
!75 = !DIGlobalVariable(name: "SensitivityThreshold", linkageName: "\01?SensitivityThreshold@CB0@@3MB", scope: !0, file: !1, line: 31, type: !76, isLocal: false, isDefinition: true)
!76 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !20)
!77 = !DIGlobalVariable(name: "EnvLuma", linkageName: "\01?EnvLuma@CB0@@3MB", scope: !0, file: !1, line: 32, type: !76, isLocal: false, isDefinition: true)
!78 = !DIGlobalVariable(name: "K", linkageName: "\01?K@CB0@@3MB", scope: !0, file: !1, line: 33, type: !76, isLocal: false, isDefinition: true)
!79 = !DIGlobalVariable(name: "WeberFechnerConstant", linkageName: "\01?WeberFechnerConstant@CB0@@3MB", scope: !0, file: !1, line: 34, type: !76, isLocal: false, isDefinition: true)
!80 = !DIGlobalVariable(name: "UseWeberFechner", linkageName: "\01?UseWeberFechner@CB0@@3_NB", scope: !0, file: !1, line: 35, type: !81, isLocal: false, isDefinition: true)
!81 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !82)
!82 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!83 = !DIGlobalVariable(name: "UseMotionVectors", linkageName: "\01?UseMotionVectors@CB0@@3_NB", scope: !0, file: !1, line: 36, type: !81, isLocal: false, isDefinition: true)
!84 = !DIGlobalVariable(name: "AllowQuarterRate", linkageName: "\01?AllowQuarterRate@CB0@@3_NB", scope: !0, file: !1, line: 37, type: !81, isLocal: false, isDefinition: true)
!85 = !DIGlobalVariable(name: "UpscaledSize", linkageName: "\01?UpscaledSize@CB0@@3V?$vector@I$01@@B", scope: !0, file: !1, line: 40, type: !72, isLocal: false, isDefinition: true)
!86 = !DIGlobalVariable(name: "UseUpscaledMotionVectors", linkageName: "\01?UseUpscaledMotionVectors@CB0@@3_NB", scope: !0, file: !1, line: 41, type: !81, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariable(name: "waveVelocityMin", linkageName: "\01?waveVelocityMin@@3PAMA", scope: !0, file: !1, line: 60, type: !88, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?waveVelocityMin@@3PAMA")
!88 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 2048, align: 32, elements: !89)
!89 = !{!90}
!90 = !DISubrange(count: 64)
!91 = !DIGlobalVariable(name: "waveLumaSum", linkageName: "\01?waveLumaSum@@3PAMA", scope: !0, file: !1, line: 63, type: !88, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?waveLumaSum@@3PAMA")
!92 = !DIGlobalVariable(name: "waveLumaSumX", linkageName: "\01?waveLumaSumX@@3PAMA", scope: !0, file: !1, line: 64, type: !88, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?waveLumaSumX@@3PAMA")
!93 = !DIGlobalVariable(name: "waveLumaSumY", linkageName: "\01?waveLumaSumY@@3PAMA", scope: !0, file: !1, line: 65, type: !88, isLocal: false, isDefinition: true, variable: [64 x float] addrspace(3)* @"\01?waveLumaSumY@@3PAMA")
!94 = !DIGlobalVariable(name: "rate2x", scope: !32, file: !1, line: 263, type: !74, isLocal: true, isDefinition: true)
!95 = !DIGlobalVariable(name: "VRSShadingRateBuffer", linkageName: "\01?VRSShadingRateBuffer@@3V?$RWTexture2D@I@@A", scope: !0, file: !4, line: 29, type: !96, isLocal: false, isDefinition: true)
!96 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 29, size: 32, align: 32, elements: !97, templateParams: !98)
!97 = !{}
!98 = !{!17}
!99 = !DIGlobalVariable(name: "ColorBuffer", linkageName: "\01?ColorBuffer@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 54, type: !100, isLocal: false, isDefinition: true)
!100 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 54, size: 128, align: 32, elements: !97, templateParams: !101)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "element", type: !46)
!103 = !DIGlobalVariable(name: "VelocityBuffer", linkageName: "\01?VelocityBuffer@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 58, type: !96, isLocal: false, isDefinition: true)
!104 = !DIGlobalVariable(name: "UpscaledVelocityBuffer", linkageName: "\01?UpscaledVelocityBuffer@@3V?$RWTexture2D@V?$vector@M$01@@@@A", scope: !0, file: !1, line: 59, type: !105, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 2> >", file: !1, line: 59, size: 64, align: 32, elements: !97, templateParams: !106)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "element", type: !108)
!108 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 59, size: 64, align: 32, elements: !109, templateParams: !112)
!109 = !{!110, !111}
!110 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !108, file: !1, line: 59, baseType: !20, size: 32, align: 32, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !108, file: !1, line: 59, baseType: !20, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!112 = !{!29, !18}
!113 = !DIGlobalVariable(name: "neighborhood", linkageName: "\01?neighborhood@@3PAY0BA@$$CAMA.1dim", scope: !0, file: !1, line: 69, type: !114, isLocal: false, isDefinition: true, variable: [256 x float] addrspace(3)* @"\01?neighborhood@@3PAY0BA@$$CAMA.1dim")
!114 = !DICompositeType(tag: DW_TAG_array_type, baseType: !20, size: 8192, align: 32, elements: !115)
!115 = !{!116, !116}
!116 = !DISubrange(count: 16)
!117 = !{i32 2, !"Dwarf Version", i32 4}
!118 = !{i32 2, !"Debug Info Version", i32 3}
!119 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
