#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; no parameters
; shader debug name: e6675b63d66a7b030bc3025dbadf63a6.pdb
; shader hash: e6675b63d66a7b030bc3025dbadf63a6
;
; Pipeline Runtime Information: 
;
;
;
; Buffer Definitions:
;
; cbuffer CB0
; {
;
;   struct CB0
;   {
;
;       uint NativeWidth;                             ; Offset:    0
;       uint NativeHeight;                            ; Offset:    4
;       uint UpscaledWidth;                           ; Offset:    8
;       uint UpscaledHeight;                          ; Offset:   12
;       uint ShadingRateTileSize;                     ; Offset:   16
;       bool DrawGrid;                                ; Offset:   20
;   
;   } CB0;                                            ; Offset:    0 Size:    24
;
; }
;
;
; Resource Bindings:
;
; Name                                 Type  Format         Dim      ID      HLSL Bind  Count
; ------------------------------ ---------- ------- ----------- ------- -------------- ------
; CB0                               cbuffer      NA          NA     CB0            cb0     1
; VRSShadingRateBuffer                  UAV     u32          2d      U0             u0     1

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "clang version 3.7 (tags/RELEASE_370/final)", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !32, globals: !64)
!1 = !DIFile(filename: "src\5CValarDebugCS.hlsl", directory: "")
!2 = !{}
!3 = !{!4, !8, !14, !22, !23}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, line: 78, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, line: 78, size: 64, align: 32, elements: !6, templateParams: !10)
!6 = !{!7, !9}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, line: 78, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, line: 78, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !{!11, !12}
!11 = !DITemplateTypeParameter(name: "element", type: !8)
!12 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 2)
!13 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!14 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint2", file: !1, line: 86, baseType: !15)
!15 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 2>", file: !1, line: 86, size: 64, align: 32, elements: !16, templateParams: !20)
!16 = !{!17, !19}
!17 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !15, file: !1, line: 86, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!18 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!19 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !15, file: !1, line: 86, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!20 = !{!21, !12}
!21 = !DITemplateTypeParameter(name: "element", type: !18)
!22 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint", file: !1, line: 38, baseType: !18)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, line: 94, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, line: 94, size: 128, align: 32, elements: !25, templateParams: !30)
!25 = !{!26, !27, !28, !29}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, line: 94, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !24, file: !1, line: 94, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!30 = !{!11, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 4)
!32 = !{!33, !44, !54, !58, !61}
!33 = !DISubprogram(name: "main", scope: !1, file: !1, line: 76, type: !34, isLocal: false, isDefinition: true, scopeLine: 77, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!34 = !DISubroutineType(types: !35)
!35 = !{null, !36, !22, !36, !36}
!36 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint3", file: !1, line: 45, baseType: !37)
!37 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<unsigned int, 3>", file: !1, line: 45, size: 96, align: 32, elements: !38, templateParams: !42)
!38 = !{!39, !40, !41}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !37, file: !1, line: 45, baseType: !18, size: 32, align: 32, flags: DIFlagPublic)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !37, file: !1, line: 45, baseType: !18, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !37, file: !1, line: 45, baseType: !18, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!42 = !{!21, !43}
!43 = !DITemplateValueParameter(name: "element_count", type: !13, value: i32 3)
!44 = !DISubprogram(name: "GetShadingRate", linkageName: "\01?GetShadingRate@@YAIV?$vector@H$01@@@Z", scope: !1, file: !1, line: 49, type: !45, isLocal: false, isDefinition: true, scopeLine: 49, flags: DIFlagPrototyped, isOptimized: false)
!45 = !DISubroutineType(types: !46)
!46 = !{!22, !47}
!47 = !DIDerivedType(tag: DW_TAG_typedef, name: "int2", file: !1, line: 51, baseType: !48)
!48 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<int, 2>", file: !1, line: 51, size: 64, align: 32, elements: !49, templateParams: !52)
!49 = !{!50, !51}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !48, file: !1, line: 51, baseType: !13, size: 32, align: 32, flags: DIFlagPublic)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !48, file: !1, line: 51, baseType: !13, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!52 = !{!53, !12}
!53 = !DITemplateTypeParameter(name: "element", type: !13)
!54 = !DISubprogram(name: "IsTileEdge", linkageName: "\01?IsTileEdge@@YA_NV?$vector@I$01@@@Z", scope: !1, file: !1, line: 54, type: !55, isLocal: false, isDefinition: true, scopeLine: 55, flags: DIFlagPrototyped, isOptimized: false)
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !14}
!57 = !DIBasicType(name: "bool", size: 32, align: 32, encoding: DW_ATE_boolean)
!58 = !DISubprogram(name: "SetColor", linkageName: "\01?SetColor@@YAXV?$vector@H$01@@V?$vector@M$03@@@Z", scope: !1, file: !1, line: 52, type: !59, isLocal: false, isDefinition: true, scopeLine: 52, flags: DIFlagPrototyped, isOptimized: false)
!59 = !DISubroutineType(types: !60)
!60 = !{null, !47, !23}
!61 = !DISubprogram(name: "IsIndicatorPosition", linkageName: "\01?IsIndicatorPosition@@YA_NV?$vector@I$01@@I@Z", scope: !1, file: !1, line: 66, type: !62, isLocal: false, isDefinition: true, scopeLine: 67, flags: DIFlagPrototyped, isOptimized: false)
!62 = !DISubroutineType(types: !63)
!63 = !{!57, !14, !22}
!64 = !{!65, !67, !68, !69, !70, !71, !73, !76}
!65 = !DIGlobalVariable(name: "NativeWidth", linkageName: "\01?NativeWidth@CB0@@3IB", scope: !0, file: !1, line: 38, type: !66, isLocal: false, isDefinition: true)
!66 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !22)
!67 = !DIGlobalVariable(name: "NativeHeight", linkageName: "\01?NativeHeight@CB0@@3IB", scope: !0, file: !1, line: 39, type: !66, isLocal: false, isDefinition: true)
!68 = !DIGlobalVariable(name: "UpscaledWidth", linkageName: "\01?UpscaledWidth@CB0@@3IB", scope: !0, file: !1, line: 41, type: !66, isLocal: false, isDefinition: true)
!69 = !DIGlobalVariable(name: "UpscaledHeight", linkageName: "\01?UpscaledHeight@CB0@@3IB", scope: !0, file: !1, line: 42, type: !66, isLocal: false, isDefinition: true)
!70 = !DIGlobalVariable(name: "ShadingRateTileSize", linkageName: "\01?ShadingRateTileSize@CB0@@3IB", scope: !0, file: !1, line: 44, type: !66, isLocal: false, isDefinition: true)
!71 = !DIGlobalVariable(name: "DrawGrid", linkageName: "\01?DrawGrid@CB0@@3_NB", scope: !0, file: !1, line: 45, type: !72, isLocal: false, isDefinition: true)
!72 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !57)
!73 = !DIGlobalVariable(name: "VRSShadingRateBuffer", linkageName: "\01?VRSShadingRateBuffer@@3V?$RWTexture2D@I@@A", scope: !0, file: !1, line: 48, type: !74, isLocal: false, isDefinition: true)
!74 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<unsigned int>", file: !1, line: 48, size: 32, align: 32, elements: !2, templateParams: !75)
!75 = !{!21}
!76 = !DIGlobalVariable(name: "ColorBuffer", linkageName: "\01?ColorBuffer@@3V?$RWTexture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 51, type: !77, isLocal: false, isDefinition: true)
!77 = !DICompositeType(tag: DW_TAG_class_type, name: "RWTexture2D<vector<float, 4> >", file: !1, line: 51, size: 128, align: 32, elements: !2, templateParams: !78)
!78 = !{!79}
!79 = !DITemplateTypeParameter(name: "element", type: !24)
!80 = !{i32 2, !"Dwarf Version", i32 4}
!81 = !{i32 2, !"Debug Info Version", i32 3}
!82 = !{!"clang version 3.7 (tags/RELEASE_370/final)"}
